simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    while (Serial.available() > 0) {
        char ch = (char)Serial.read();
        if (ch == '\r' || ch == '\n') {
            line[pos] = '\0';
            handleUsbCommand(line);
            pos = 0;
        } else if (ch == 8 || ch == 127) {
            if (pos > 0) { pos--; }
        } else if (ch >= 32 && ch <= 126) {
            if (pos < sizeof(line) - 1) {
                line[pos++] = ch;
            }
        }
    }
}
#else
static void serviceUsbCommands() {}
#endif

static void sendStartAck(uint8_t status, uint32_t startToken, uint32_t rxUs)
{
    MsgStartAck ack = { CMD_START_ACK, NODE_ID, status, startToken, rxUs };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
}

static bool storeReadyForHotWait()
{
    return (g_rec_n_batches == 0) || (g_store_buf != nullptr && g_store_ts_us != nullptr);
}

static uint16_t clampPsocCaptureBatches(uint16_t n)
{
    if (n > PSOC_CAPTURE_MAX_BATCHES) {
        return (uint16_t)PSOC_CAPTURE_MAX_BATCHES;
    }
    return n;
}

static uint32_t expectedViewCaptureMs(uint16_t n_batches)
{
    uint32_t fs = psoc.sampleRate();
    if (fs == 0) fs = 3000u;
    uint32_t ms = ((uint32_t)n_batches * (uint32_t)SPI_BATCH_SAMPLES * 1000u + fs - 1u) / fs;
    return ms + PSOC_VIEW_START_FALLBACK_EXTRA_MS;
}

static void enterHotWait(uint16_t n_batches)
{
    n_batches = clampPsocCaptureBatches(n_batches);
    allocStore(n_batches);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_t_start_us     = 0;
    g_store_fill     = 0;
    g_view_remaining = 0;
    g_view_store_active = false;
    g_debug_count    = 0;
    g_debug_last_us  = (uint32_t)micros();
    g_view_start_fallback_sent = false;
    g_state = HOT_WAIT;
    /* Armar el PSoC por UART: set N y pre-start (queda esperando flanco SYNC). */
    psoc.setN(n_batches);
    psoc.preStart();
    SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT n=%u ready=%u\n",
                     n_batches, (unsigned)storeReadyForHotWait());
    LOGM("HOTWAIT", "n=%u,ready=%u,sync=%d,bytes=%lu",
         n_batches, (unsigned)storeReadyForHotWait(),
         digitalRead(SYNC_TO_PSOC_PIN), (unsigned long)psoc.bytesRx());
}

static void sendHotWaitAck()
{
    uint8_t ok = (g_state == HOT_WAIT && storeReadyForHotWait()) ? 1 : 0;
    MsgHotWaitAck ack = {
        CMD_HOTWAIT_ACK, NODE_ID, ok, (uint8_t)g_state, g_rec_n_batches
    };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
    SLAVE_LOG_PRINTF("[SLAVE] HOTWAIT_ACK ok=%u state=%u n=%u\n",
                     ok, (unsigned)g_state, g_rec_n_batches);
}

static void debugEspSetRamp(bool enable)
{
    g_debug_mode = enable;
    g_debug_count = 0;
    g_debug_last_us = (uint32_t)micros();
    if (enable) {
        g_store_fill  = 0;   /* reset store index para que cada test/debug empiece desde 0 */
        if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
            /* Modo streaming/test: A7 arranca la rampa inmediatamente. */
            g_t_start_us = (uint64_t)g_debug_last_us;
            g_state = SAMPLING;
        } else if (g_state == WAIT_ARM || g_state == STOPPED) {
            /* Store-and-forward: A7 solo selecciona debug; START/SYNC arranca. */
            g_state = ARMED;
        }
    } else if (g_state == SAMPLING) {
        g_state = STOPPED;
    } else if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
        g_state = WAIT_ARM;
    }
}

static void handleSetConfig(const MsgSetConfig *cfg)
{
    if (cfg->node_id != NODE_ID) return;
    if (g_state == SAMPLING) {
        SLAVE_LOG_PRINTF("[SLAVE] cfg ignored during capture sub=0x%02X\n",
                         cfg->sub_cmd);
        LOGM("CFG_IGN_CAPTURE", "sub=0x%02X", cfg->sub_cmd);
        return;   /* Sin ACK por radio mientras se muestrea. */
    }
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        sendCfgAck(cfg->sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] cfg busy sub=0x%02X pending=0x%02X\n",
                         cfg->sub_cmd, g_cfg_sub_cmd);
        LOGM("CFG_BUSY", "sub=0x%02X,pending=0x%02X", cfg->sub_cmd, g_cfg_sub_cmd);
        return;
    }

    const uint8_t subCmd = cfg->sub_cmd;
    const uint8_t param = cfg->param;
    uint8_t ok = 1;
    bool waitAck = false;
    switch (cfg->sub_cmd) {
        case 0xA6:                       /* PGA */
            if (!isGainCode(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case 0xA9:                       /* PGAvdac */
            if (!isGainCode(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case 0xAA:                       /* VDAC (calibración) */
            waitAck = true;
            break;
        case PSOC_CMD_CALIBRATE:
            waitAck = true;
            break;
        default:
            ok = 0;
            break;
    }
    if (ok && waitAck) {
        if (!ensurePsocReadyForConfig()) {
            ok = 0;
            sendCfgAck(subCmd, ok);
        } else {
            switch (subCmd) {
                case 0xA6:
                    psoc.setPga(param);
                    break;
                case 0xA9:
                    psoc.setPgavdac(param);
                    break;
                case 0xAA:
                    psoc.setVdac(param);
                    break;
                case PSOC_CMD_CALIBRATE:
                    psoc.calibrate();
                    break;
                default:
                    ok = 0;
                    break;
            }
            if (ok) {
                waitForPsocConfigAck(subCmd, param);
            } else {
                sendCfgAck(subCmd, ok);
            }
        }
    } else {
        sendCfgAck(subCmd, ok);
    }
    SLAVE_LOG_PRINTF("[SLAVE] cfg sub=0x%02X p=%u ok=%u\n",
                     subCmd, param, ok);
    LOGM("CFG", "sub=0x%02X,p=%u,ok=%u,wait=%u",
         subCmd, param, ok, (unsigned)waitAck);
}

static void handleDebugNode(const MsgDebugNode *dbg)
{
    if (dbg->node_id != NODE_ID) return;
    bool enable = (dbg->enable != 0);
    debugEspSetRamp(enable);
    sendCfgAck(0xA7, 1);
    SLAVE_LOG_PRINTF("[SLAVE] debug_node=%d\n", (int)g_debug_mode);
}

